{
  "name": "Ритуалы — начало",
  "icon": "bloodmagic:activationcrystalcreative",
  "category": "bloodmagic:rituals",
  "priority": "true",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Когда твой $(l:bloodmagic:altar/blood_altar)Кровавый алтарь$(/l) достигнет тира 3, можно погружаться в удивительный мир ритуалов. $(br2)Для работы с ритуалами понадобятся: $(li)$(l:bloodmagic:rituals/activation_crystals)кристалл активации$(). На тире 3 доступен только $(item)слабый кристалл$(). $(li)$(item)главный ритуальный камень$(). Каждый ритуал требует ровно один такой камень в центре."
    },
    {
      "type": "patchouli:text",
      "text": "$(li)Достаточно ритуальных камней, чтобы построить ритуал. $(li)(Рекомендуется) $(l:bloodmagic:rituals/ritual_diviner)Ритуальный дивинер$(). Он не обязателен, но сильно упрощает строительство ритуалов. $(br2)Построить ритуал довольно просто. Нажимай [$(k:sneak)] + [$(k:use)] с ритуальным дивинером в руке, пока не появится название нужного ритуала. Количество требуемых рун можно посмотреть, наведя на него в"
    },
    {
      "type": "patchouli:text",
      "text": "инвентаре и удерживая [$(k:sneak)]. $(br2)Поставь главный ритуальный камень и удерживай [$(k:use)], пока все камни не будут размещены и окрашены нужным элементом. Наконец, нажми [$(k:use)] по главному ритуальному камню, держа в руке кристалл активации. Если всё сделано правильно, появится сообщение 'A rush of energy flows through the ritual!'. Ритуал активирован."
    },
    {
      "type": "patchouli:text",
      "text": "Если этого не произошло, могло пойти не так несколько вещей. Если вместо этого появляется текст 'You feel a push, but are too weak to complete this ritual', значит в твоей $(thing)сети души$() недостаточно $(blood)LP$(), чтобы активировать ритуал. $(br2)Если сообщение такое: 'You feel that these runes are not configured correctly...', значит что‑то не так с размещением рун. Проверь область на наличие препятствий и попробуй собрать ритуал снова."
    },
    {
      "type": "patchouli:text",
      "text": "Помни: некоторые ритуалы простираются на несколько блоков выше и ниже главного ритуального камня. Если ошибок нет, убедись, что кристалл активации привязан к твоей сети души — это делается нажатием [$(k:use)] при удержании кристалла. $(br2)Важно: кристалл не обязан быть привязан к ТВОЕЙ сети — если удастся добыть кристалл другого игрока, можно активировать ритуалы, используя его $(blood)LP$(). Береги свой!"
    },
    {
      "type": "patchouli:text",
      "text": "И ещё: все ритуалы реагируют на сигнал $(fire)редстоуна$(), поэтому рычаг на боку главного ритуального камня — хороший способ их отключать. Это можно совместить с информацией из $(l:bloodmagic:altar/redstone_automation)Редстоун и автоматизация$(), чтобы ритуалы отключались автоматически задолго до того, как $(thing)сеть души$() полностью опустеет."
    }
  ]
}
