{
  "name": "Редстоун и автоматизация",
  "icon": "minecraft:redstone",
  "category": "bloodmagic:altar",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(l:bloodmagic:altar/blood_altar)Кровавый алтарь$() — фантастический инструмент, но стоять и ждать, пока изготовят сланцы, — это не ваше представление о хорошем времяпрепровождении. К счастью, предметы и $(blood)LP$() можно автоматически вводить и выводить из алтаря, хотя и с некоторыми оговорками. $(br2)Хотя простой $(item)Hopper$() позволяет вводить элементы по конвейеру, Altar не мешает ему вводить более 1 элемента за раз. Он с радостью создаст 64 планшета в одном."
    },
    {
      "type": "patchouli:text",
      "text": "идите, потребляя для этого в 64 раза больше $(blood)LP$(), чем обычно, но если вы не сможете доставить указанный $(blood)LP$() достаточно быстро, у вас возникнут проблемы. $(br2)Кроме того, алтарь не делает различий между вводом и выводом, поэтому без какого-либо фильтра предметы будут втягиваться и выниматься так быстро, как только может справиться ваша система передачи предметов. Возможно, будет полезно взглянуть на $(l:bloodmagic:demon_will/item_routing/routing_nodes)Routing Nodes$()..."
    },
    {
      "type": "patchouli:text",
      "text": "Алтарь также поддерживает передачу $(blood)Сущность жизни$() как во внешний резервуар, так и из него. Просто подключите выбранную вами трубку для жидкости, и вы сможете хранить излишки $(blood)Сущность жизни$() для последующих поделок. $(br2)Обратите внимание, что скорость передачи по умолчанию очень низкая. Если вы хотите ускорить этот процесс, вам лучше всего изучить $(l:bloodmagic:altar/blood_rune/acceleration_rune)Acceleration Руны$() и $(l:bloodmagic:altar/blood_rune/dislocation_rune)Displacement Руны$()."
    },
    {
      "type": "patchouli:text",
      "text": "Не забывайте, что эта $(blood)Сущность жизни$() берется не непосредственно из самого $(l:bloodmagic:altar/blood_altar)altar$(), а из второго, секретного внутреннего резервуара. Этот резервуар может содержать $(thing)до 10%$() $(blood)Сущность жизни$(), который может содержать сам алтарь, поэтому, если кажется, что числа не складываются точно правильно, или если кажется, что $(blood)Сущность жизни$() исчезает с вашего алтаря, вероятно, это именно то, к чему он идет. Те же ограничения применяются к подаче $(blood)Сущность жизни$()."
    },
    {
      "type": "patchouli:text",
      "text": "Количество $(blood)Сущность жизни$() в $(l:bloodmagic:altar/blood_altar)Кровавом алтаре$() можно прочитать с помощью компаратора сбоку, аналогично ванильному сундуку. $(br2)Если вы поместите $(item)Bloodstone Brick$() под алтарь, компаратор вместо этого прочитает значение $(l:bloodmagic:altar/soul_network)Сеть душ$(/l) владельца любого шара, помещенного в Алтарь. $(br2)Сила сигнала зависит от размера шара в алтаре, а не от максимального $(blood)LP$() сети."
    },
    {
      "type": "patchouli:text",
      "text": "Например, если у вас есть $(blood)500,000 LP$(), сфера слабой крови будет отображаться как полностью заполненная, а сфера главной крови будет заполнена только наполовину. Это можно использовать, например, для деактивации определенных ритуалов, когда у вас заканчивается $(blood)LP$(), чтобы гарантировать, что он у вас не закончится. $(br2)Наконец, размещение $(item)Redstone Lamp$() под алтарем заставит его выдавать сигнал красного камня после завершения операции крафта."
    }
  ]
}